Tekla Open API Reference for Tekla Structures 2025
Picker.PickObjectsEnum Enumeration
 The possible model object pick types for many objects.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PickObjectsEnum
Public Enumeration PickObjectsEnum
Members
Member name | Value | Description
PICK_N_OBJECTS | 0 |  Pick multiple model objects of any type.
PICK_N_PARTS | 1 |  Pick multiple parts.
PICK_N_WELDS | 2 |  Pick multiple welds.
PICK_N_BOLTGROUPS | 3 |  Pick multiple bolt groups.
PICK_N_REINFORCEMENTS | 4 |  Pick multiple reinforcements.
See Also
Reference
Tekla.Structures.Model.UI Namespace